''' Користувач вводить число. Програма виводить його квадрат.

Приклад:

Введіть число: 5

Квадрат числа: 25 '''

''' 
kvadrat_chisla = input("Введите число:")
print("Kвадрат числа:", int(kvadrat_chisla)** 2)
'''

'''2. “Середнє трьох чисел”

Програма запитує три числа і виводить їх середнє арифметичне.

Приклад:

Введіть три числа: 2, 4, 6

Середнє: 4.0 '''

'''
first_num = input("Введите 1 число:")
second_num = input("Введите 2 число:")
third_num = input("Введите 3 число:")

sr_arif = (float(first_num) + float(second_num) + float(third_num)) / 3
print("Середнє:", sr_arif)
'''

'''
3. “Перетворення хвилин у години”

Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.

Приклад: 

Введіть кількість хвилин: 135

2 години 15 хвилин
'''

'''
minut = input("Введите количество минут")
chasov = int(minut) // 60
ostatok = int(minut) % 60

print("Часов:", chasov, "Минут: ", ostatok)
'''

'''
4. “Розрахунок знижки”

Користувач вводить ціну товару і розмір знижки у %.

Програма виводить кінцеву ціну.

Приклад:

Введіть ціну: 1000

Введіть знижку (%): 15

Ціна зі знижкою: 850.0
'''

'''
tsena = float(input("Введите цену: "))
skidka = input("Введите скидку (%): ")

summa_skidki = tsena * float(skidka) // 100

print("Итого: ", tsena - summa_skidki)
'''

'''
5. “Остання цифра числа”

Користувач вводить ціле число, програма виводить його останню цифру.

Приклад:

Введіть число: 347

Остання цифра: 7
'''

'''
chislo = int(input("Введите число: "))
num2 = int(chislo) // 10
num3 = num2 * 10
last_tsifra = chislo - num3
print("Последняя цифра числа: ", last_tsifra)
'''

'''
6. “Периметр прямокутника”

Користувач вводить довжину і ширину. Програма виводить периметр.

Приклад:

Введіть довжину: 5

Введіть ширину: 3

Периметр: 16
'''

'''
a = int(input("Введите а: "))
b = int(input("Введите b: "))

p = 2 * (a + b)
print("Периметр прямоугольника = ", p)
'''

'''
7. Виведення числа в стовпчик

Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:

1

2

3

4

Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod). Виведення в стовпчик можна зробити за допомогою 4-х функцій print.

Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число, яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.

Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.

Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.
'''

'''
chislo = int(input("Введите ЦЕЛОЕ 4-х значное число: "))
tsifra_1 = chislo // 1000
tsifra_2 = ((chislo // 100) % 10)
tsifra_3 = (chislo % 100) // 10
tsifra_4 = chislo % 10
#print(tsifra_2)
print(tsifra_1)
print(tsifra_2)
print (tsifra_3)
print(tsifra_4)
'''